
```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/bookie/bookie/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/bookie/bookie

To view this run in a browser, visit:
https://app.terraform.io/app/wager/bookie/runs/run-BgANKkfGikjUiFZE

Waiting for the plan to start...

Terraform v1.1.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_organization_secret.gcp_service_account_key will be created
  + resource "github_actions_organization_secret" "gcp_service_account_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "GCP_SERVICE_ACCOUNT_KEY"
      + updated_at      = (known after apply)
      + visibility      = "all"
    }

  # google_service_account_key.github will be created
  + resource "google_service_account_key" "github" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = "projects/wager-233003/serviceAccounts/github@wager-233003.iam.gserviceaccount.com"
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ github_codespaces_organization_secret = (sensitive value)

```
